duraseb/meshtastic_firmware/variants/nrf52840/diy/birbmesh_one/variant.cpp
/*
  Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
  Copyright (c) 2016 Sandeep Mistry All right reserved.
  Copyright (c) 2018, Adafruit Industries (adafruit.com)
  Copyright (c) 2026, KokoSoft

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
  See the GNU Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#include "variant.h"
#include "nrf.h"
#include "wiring_constants.h"
#include "wiring_digital.h"

const uint32_t g_ADigitalPinMap[] = {
    // P0
    0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31,

    // P1
    32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47
};


#define SX126X_CS (32 + 13)      // P1.13 FIXME - we really should define LORA_CS instead


void initVariant()
{
	/* Adafruit_nRF52_Arduino in the init function sets all pins to high,
	 * overriding the default states configured by the bootloader.
	 * Need to reconfigure them again.
	 */

	// Enable charger
	pinMode(PIN_CHARGER, OUTPUT);
	digitalWrite(PIN_CHARGER, CHARGER_STATE_ENABLED);

    // 3V3 Power Rail
    pinMode(PIN_3V3_EN, OUTPUT);
    digitalWrite(PIN_3V3_EN, HIGH);
}

const int off_pins[] = {
	PIN_3V3_EN, // Shutdown EXTVCC
	PIN_GPS_EN,
	SX126X_RESET, // Switch radio power off by asserting reset
	LORA_CS,
	// Disable radio
#ifdef SX126X_POWER_EN
	SX126X_POWER_EN,
#else
	SX126X_RXEN,
#endif
};

void variant_shutdown()
{
	for (unsigned int i = 0; i < NRFX_ARRAY_SIZE(off_pins); i++)
		digitalWrite(off_pins[i], LOW);

    nrf_gpio_cfg_input(BUTTON_PIN, NRF_GPIO_PIN_PULLUP); // Enable internal pull-up on the button pin
    nrf_gpio_pin_sense_t sense = NRF_GPIO_PIN_SENSE_LOW; // Configure SENSE signal on low edge
    nrf_gpio_cfg_sense_set(BUTTON_PIN, sense);           // Apply SENSE to wake up the device from the deep sleep
}
